/******************************************************************************

                  版权所有 (C), 2013-2023, 深圳博思高科技有限公司

 ******************************************************************************
  文 件 名   : eth_cfg.h
  版 本 号   : 初稿
  作    者   : 张舵
  生成日期   : 2020年1月6日
  最近修改   :
  功能描述   : 网络相关参数
  函数列表   :
  修改历史   :
  1.日    期   : 2020年1月6日
    作    者   : 张舵
    修改内容   : 创建文件

******************************************************************************/

#ifndef __ETH_CFG__H
#define __ETH_CFG__H


/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "stm32f4xx_conf.h"



/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
#define   HOST_NAME       "192.168.110.78"     //服务器IP地址 线下 
#define   HOST_PORT     1883    //由于是TCP连接，端口必须是1883

#define DEVICE_PUBLISH		"/smartCloud/server/msg/device"	
#define DEVICE_SUBSCRIBE	"/smartCloud/terminal/msg/"DEVICE_SN    
//#define DEVICE_SN           "33F85538F0EB8D1796F6"
#define DEVICE_SN           "3E51E8848A4C00863617"
//#define DEVICE_SN           "0BF49D025715AFB3B0A1"


//#define DEV_FACTORY_PUBLISH		"/smartCloud/server/msg/device"	
//#define DEV_FACTORY_SUBSCRIBE	"/smartCloud/terminal/msg/"DEVICE_SN    
//#define DEV_FACTORY_SN           "3E51E8848A4C00863617"




/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/


#endif


